In [7]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [8]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.277163  1.156513
1  X   beta  0.849972  0.414011
2  Y  alpha  0.923809  0.197756
3  Y   beta -1.027822 -1.297253
4  Z  alpha  0.436358 -0.162591

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [7]:
group1.mean()

k1
X    0.231136
Y   -0.082969
Z    0.881804
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [9]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [11]:
dframe['dataset1'].groupby([cities, month]).mean()
#group by city and month, grab the mean by that
#it is lined up the city and month first and group by this fashion

LA  FEB   -0.043766
    JAN   -0.591578
NY  FEB    0.425640
    JAN    0.693921
Name: dataset1, dtype: float64

In [5]:
dframe.groupby('k1').mean()
#group by k1 and grab all the means

    dataset1  dataset2
k1
X   1.654270  0.349571
Y  -0.312116  0.233583
Z  -0.825886  0.039988

In [6]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.979875  1.453577
   beta   1.328664 -0.754436
Y  alpha -1.227721  0.600528
   beta   0.603488 -0.133362
Z  alpha -0.825886  0.039988

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.506039 -1.458468
1  X   beta -0.043766 -0.524275
2  Y  alpha -0.591578 -1.624857
3  Y   beta  0.425640 -0.921296
4  Z  alpha  0.881804  0.474354

In [25]:
for name, group in dframe.groupby('k1'):
    print ('this is the', name ,'group')
    print (group)
    print ('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.506039 -1.458468
1  X   beta -0.043766 -0.524275


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.591578 -1.624857
3  Y   beta  0.425640 -0.921296


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.881804  0.474354

In [31]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    #print ('Key1=',k1,' Key2=',k2)
    print('key1= %s Key2= %s' %(k1,k2))
    print(group)
    print('\n')

key1= X Key2= alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.506039 -1.458468


key1= X Key2= beta
  k1    k2  dataset1  dataset2
1  X  beta -0.043766 -0.524275


key1= Y Key2= alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.591578 -1.624857


key1= Y Key2= beta
  k1    k2  dataset1  dataset2
3  Y  beta   0.42564 -0.921296


key1= Z Key2= alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.881804  0.474354

In [34]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.506039 -1.458468
1  X   beta -0.043766 -0.524275

In [37]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes.axis=1)))

SyntaxError: keyword can't be an expression (<ipython-input-37-8ce1b29cbdfa>, line 1)

In [38]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [39]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.458468
   beta  -0.524275
Y  alpha -1.624857
   beta  -0.921296
Z  alpha  0.474354